sunchenyuan15/STM32/ALIENTEK MINISTM32 软件SPI读写W25Q64/Hardware/MySPI.c
#include "stm32f10x.h"                  // Device header

void MySPI_W_SS(uint8_t BitValue)
{
	GPIO_WriteBit(GPIOA, GPIO_Pin_4, (BitAction)BitValue);	
}

void MySPI_W_SCK(uint8_t BitValue)
{
	GPIO_WriteBit(GPIOA, GPIO_Pin_5, (BitAction)BitValue);	
}

void MySPI_W_MOSI(uint8_t BitValue)
{
	GPIO_WriteBit(GPIOA, GPIO_Pin_7, (BitAction)BitValue);	
}

uint8_t MySPI_R_MISO(void)
{
	return GPIO_ReadInputDataBit(GPIOA, GPIO_Pin_6);
}
	
void MySPI_Init(void)
{
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA, ENABLE);
	GPIO_InitTypeDef GPIO_InitStructure;
	
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_6;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOA, &GPIO_InitStructure);
	
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_4|GPIO_Pin_5|GPIO_Pin_7;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOA, &GPIO_InitStructure);
	
	MySPI_W_SS(1);
	MySPI_W_SCK(0);
	
}

void MySPI_Start(void)
{
	MySPI_W_SS(0);
}

void MySPI_Stop(void)
{
	MySPI_W_SS(1);
}

//交换一个字节 模式0
uint8_t MySPI_SwapByte(uint8_t ByteSend)
{
	uint8_t i, ByteReceive=0x00;
	 
//	MySPI_W_MOSI(ByteSend & 0x80); //最高位放入MOSI
//	
//	
//	MySPI_W_SCK(1);
//	if (MySPI_R_MISO()==1)
//	{
//		ByteReceive |= 0x80;//主机接受从机最高位
//	}
//	
//	
//	MySPI_W_SCK(0);
//	MySPI_W_MOSI(ByteSend & 0x80); //次高位放入MOSI
//	
//	
//	MySPI_W_SCK(1);
//	if (MySPI_R_MISO()==1)
//	{
//		ByteReceive |= 0x40;//主机接受从机次高位
//	}

//掩码操作 依次挑出每一位
	for(i=0; i<8; i++)
	{
		MySPI_W_MOSI(ByteSend & (0x80 >> i));//按位与
		MySPI_W_SCK(1);
		if (MySPI_R_MISO()==1)
		{
			ByteReceive |= (0x80 >> i);//按位或 ByteReceive = ByteReceive | (0x80 >> i)
		}
		MySPI_W_SCK(0);	
	}
	
	return ByteReceive;
}

//移位操作
uint8_t MySPI_SwapByte_2(uint8_t ByteSend)
{
	uint8_t i;
	for(i=0; i<8; i++)
	{
		MySPI_W_MOSI(ByteSend & 0x80);
		ByteSend <<= 1;//左移一位 低位补0
		MySPI_W_SCK(1);
		if (MySPI_R_MISO()==1)
		{
			ByteSend |= 0x01;//放在最低位
		}
		MySPI_W_SCK(0);	
	}
	return ByteSend;
}



